Repository: nguyenvietcuong0112/health_app
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: AI Health & Lifestyle
vi: AI Sức khỏe & Lối sống

source: Daily Summary
vi: Tổng quan trong ngày

source: AI Suggestion
vi: Gợi ý từ AI

source: Steps
vi: Số bước

source: Calories
vi: Calo

source: Sleep
vi: Giấc ngủ

source: Edit Data
vi: Chỉnh sửa

source: Update Your Data
vi: Cập nhật dữ liệu

source: Calories (kcal)
vi: Lượng calo (kcal)

source: Sleep (hours)
vi: Giờ ngủ

source: Cancel
vi: Hủy

source: Save
vi: Lưu

source: AI Assistant
vi: Trợ lý AI

# askAboutHealth
source: Ask about health, fitness, nutrition...
vi: Hỏi về sức khỏe, thể hình, dinh dưỡng...

source: AI Chat
vi: Trò chuyện với AI

source: 💧 Drink Water
vi: 💧 Uống Nước

# drinkWaterBody
source: Time to hydrate! Go grab a glass of water.
vi: Đã đến lúc bổ sung nước! Hãy uống một ly nước nhé.

source: 💪 Move Your Body
vi: 💪 Vận động nào

# moveYourBodyBody
source: A short walk or a good stretch can make all the difference.
vi: Đi bộ một chút hoặc vươn vai có thể tạo ra sự khác biệt.

source: 😴 Time for Bed
vi: 😴 Đến giờ đi ngủ

# timeForBedBody
source: Sweet dreams! Aim for a full 8 hours.
vi: Chúc ngủ ngon! Hãy cố gắng ngủ đủ 8 tiếng nhé.

source: Sleep Chart
vi: Biểu đồ giấc ngủ

# chatHint
source: Type a message...
vi: Nhập tin nhắn...

# clearChat
source: Clear Chat History
vi: Xóa lịch sử chat

# clearChatTitle
source: Clear Entire Conversation?
vi: Xóa toàn bộ cuộc trò chuyện?

# clearChatContent
source: Are you sure you want to delete the entire chat history? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa toàn bộ lịch sử trò chuyện không? Hành động này sẽ không thể khôi phục.

source: Clear
vi: Xóa
